      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROGRAMA-1.
       DATA DIVISION.
           LINKAGE SECTION.



       PROCEDURE DIVISION.
            DISPLAY 'funciona'.
            EXIT PROGRAM.
       END PROGRAM SUBPROGRAMA-1.
