      ******************************************************************
      * AUTHOR: Enriquez Ignacio
      * DATE : 31/05/2023
      * EXTENSION : cbl
      *******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-MUNDO.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "Hola-Mundo".
           STOP RUN.
       END PROGRAM HOLA-MUNDO.
